In [2]:
import pandas as pd
## Series ##

data= (1,2,3,4,5)
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
## Creating series from dictionary##

dict= {"a":1,"b":2,"c":3,"d":4}
series=pd.Series(dict)

# Acessing data #

print(series["b"])

2

In [17]:
## Customized Index ##
data=(10,20,30)
my_index=(1,2,3)
pd.Series(data, index=my_index)

1    10
2    20
3    30
dtype: int64

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [ ]:

data = { 
    'name':['Shivam', 'Satyam', 'Sundram'],
    'age': [17, 18, 19],
    'city': ['Patna', 'Ara', 'Delhi']
}

# Create DataFrame
df = pd.DataFrame(data)

# Print DataFrame
print(df)

      name  age   city
0   Shivam   17  Patna
1   Satyam   18    Ara
2  Sundram   19  Delhi

In [8]:
# Named index #

dataA = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df1 = pd.DataFrame(dataA, index = ["day1", "day2", "day3"])

print(df1)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [9]:
print(df1.head(1))
print(df1.tail(2))

      calories  duration
day1       420        50
      calories  duration
day2       380        40
day3       390        45

In [12]:
## Acessing Data from DataFrame ##


data = { 
    'name':['Shivam', 'Satyam', 'Sundram'],
    'age': [17, 18, 19],
    'city': ['Patna', 'Ara', 'Delhi']
}

df = pd.DataFrame(data)


nm=df['name']
print(nm)

## Here we picked 1 column so it became a series ##
print(type(nm))

0     Shivam
1     Satyam
2    Sundram
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
## loc

#refer to the row index:
print(df.loc[0])
# Note: This example returns a Pandas Series.

#use a list of indexes:
print(df.loc[[0, 1]])
# Note: When using [], the result is a Pandas DataFrame.

#refer to the named index:
print(df1.loc["day2"])

## iloc
# It taks index location as attribute

print(df.iloc[1,1])

# Passing a range of index
print(df.iloc[:,0:1])

name    Shivam
age         17
city     Patna
Name: 0, dtype: object
     name  age   city
0  Shivam   17  Patna
1  Satyam   18    Ara
calories    380
duration     40
Name: day2, dtype: int64
18
      name
0   Shivam
1   Satyam
2  Sundram

In [ ]:
##  Getting customized data using loc and updating data

data = pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata', 
                               'Mahindra', 'Maruti', 'Hyundai', 
                               'Renault', 'Tata', 'Maruti'], 
                     'Year': [2012, 2014, 2011, 2015, 2012, 
                              2016, 2014, 2018, 2019], 
                     'Kms Driven': [50000, 30000, 60000, 
                                    25000, 10000, 46000, 
                                    31000, 15000, 12000], 
                     'City': ['Gurgaon', 'Delhi', 'Mumbai', 
                              'Delhi', 'Mumbai', 'Delhi', 
                              'Mumbai', 'Chennai',  'Ghaziabad'], 
                     'Mileage':  [28, 27, 25, 26, 28, 
                                  29, 24, 21, 24]}) 
  
display(data) 

# selecting cars with brand 'Maruti' and Mileage > 25 
print(data.loc[(data.Brand == 'Maruti') & (data.Mileage > 25)])

# updating values of Mileage if Year < 2015 
data.loc[(data.Year < 2015), ['Mileage']] = 22
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       22
1   Hyundai  2014       30000      Delhi       22
2      Tata  2011       60000     Mumbai       22
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       22
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       22
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [25]:
## at
#  In pandas, the at[] function is used to access one value of a row and column in data.
# The first is the position of the value and a column and the second is the title of the column.
# loc[], works similarly, but the at[] function is more efficient and faster because it can access one value at a time.

print(df.at[0,"name"])

## iat
# Pandas iat[] method is used to return data in a dataframe at the passed location. 
# The passed location is in the format [position in the row, position in the column].
#  This method works similarly to Pandas iloc[] but iat[] is used to return only a single value and hence works faster than it.

print(df.iat[0,1])

Shivam
17

In [21]:
## Data Manipulation ##

# Adding a column #
df["salery"]=[50000,60000,70000]

# Removing a column #
df.drop('salery',axis=1, inplace=True)

In [35]:
# Statical Summery #
df.describe()

# Info about data #
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Username           5 non-null      object
 1   Identifier         4 non-null      float64
 2   One-time password  5 non-null      object
 3   Recovery code      5 non-null      object
 4   First name         5 non-null      object
 5   Last name          4 non-null      object
 6   Department         5 non-null      object
 7   Location           4 non-null      object
dtypes: float64(1), object(7)
memory usage: 452.0+ bytes

In [41]:
## Data Analysis with Pandas ##

import pandas as pd
df= pd.read_csv("username-password-recovery-code.csv")

# Check the number of maximum returned rows:
print(pd.options.display.max_rows) 
# Increase the maximum number of rows to display the entire DataFrame:
pd.options.display.max_rows = 9999


print(df.head(3))
print(df.describe())

9999
    Username  Identifier One-time password Recovery code First name Last name  \
0   booker12      9012.0            12se74        rb9012     Rachel    Booker
1     grey07      2070.0            04ap67        lg2070      Laura      Grey
2  johnson81      4081.0            30no86        cj4081      Craig   Johnson

  Department    Location
0      Sales  Manchester
1      Depot         NaN
2      Depot      London
        Identifier
count     4.000000
mean   6127.250000
std    3620.798749
min    2070.000000
25%    3578.250000
50%    6546.500000
75%    9095.500000
max    9346.000000

In [ ]:
## Handeling missing values or empty cells. ##

df.isnull()
df.isnull().any(axis=1)
df.isnull().sum()
df.fillna(0, inplace=True)
          
## or replace with mean

df['Identifier_fillNA']=df['Identifier'].fillna(df['Identifier'].mean()) 
#or
df['Identifier'].fillna(df['Identifier'].mean())  

# we can also drpo the rows containing missing values #
new_df = df.dropna()
## another method
df.dropna(inplace=True)#Note: Now, the dropna(inplace = True) will NOT return a new DataFrame, 
#                                       but it will remove all rows containing NULL values from the original DataFrame.

In [ ]:
## Renaming Columns ##

# df.rename(columns={"old_name":"new_name"})
df.rename(columns={"city":"Palce"})

## Change Datatype ##

# df['value_new']=df['value'].astype(float)

## Define new functions in values ##

# df['new_value']=df['value'].apply(lambda x:x**2)

      name  age  Palce
0   Shivam   17  Patna
1   Satyam   18    Ara
2  Sundram   19  Delhi

In [ ]:
## Data aggregation and grouping ##
import pandas as pd

df1 = {
    'key': ['A', 'B', 'C'],
    'value': [1, 2, 3]
}

df2 = {
    'key': ['A', 'B', 'D'],
    'value': [4, 5, 6]
}

df1 = pd.DataFrame(df1)
df2 = pd.DataFrame(df2)

pd.merge(df1,df2,on='key',how='inner')

pd.merge(df1,df2,on='key',how='outer')

pd.merge(df1,df2,on='key',how='left')

pd.merge(df1,df2,on='key',how='right')

In [ ]:
## Reading data from different sources ##
import pandas as pd
from io import StringIO
data={}
df=pd.read_json(StringIO(data))
df.to_json(orient='record')    ## By Default orient = index ##


df=pd.read_csv('http...............',header=None)
df.head()
df.to_csv('vine.csv')   ## new file to save ##

pd.read_hrml('url',match='country',header=0)